"VideoHandler.SettingUp" = "Initializing Video Communications Engine...";
"VideoHandler.InitFailed" = "An Error has occurred while initializing Video Communications Engine. Please try again later...";
"VideoHandler.Connecting" = "Connecting...";
"VideoHandler.CallStartFailed" = "Failed to Start Call";
"VideoHandler.Rollover" = "VideoHandler.Rollover";
"VideoHandler.CallStarted" = "Connected!";
"VideoHandler.CallFailed" = "Video Call Failed";
"VideoHandler.ClientFailure" = "Device has failed to connect. Please try again. If this message continues to pop up, please contact your ISP Department.";
"VideoHandler.ConversationEnded" = "Conversation Ended";
"VideoHandler.ParticipantJoined" = "Interpreter joined - %@ (%@)";
"VideoHandler.ParticipantJoined.Agent" = "Agent joined - %@ (%@)";
"VideoCall.TimedOut" = "This Call has been ended.";

"VoiceHandler.Connecting" = "Connecting...";
"VoiceHandler.Starting" = "Starting ...";
"VoiceHandler.InitFailed" = "Could not initialize Audio";
"VoiceHandler.CallStartFailed" = "Failed Starting Call";
"VoiceHandler.CallStartTimedOut" = "Call Timed Out...";
"VoiceHandler.CallConnected" = "Connected Successfully!";
"VoiceHandler.CallConnecting" = "Please wait, we are connecting your call!";
"VoiceHandler.CallCompleted" = "Call Completed";
"VoiceHandler.ChoiceAudio" = "Choose Device";
"Voice.MissingServiceNumber" = "This service does not have a configured number!";

"Login.in" = "Logging in...";
"Login.success" = "Logged In!";
"Login.failed" = "Login Failed!";
"Login.missingUser" = "Failed to Gather User Information";
"Login.2FAToken.Required" = "Please enter your 2FA Code";
"Login.2FAToken.Failed" = "The 2FA code you entered is incorrect";
"Login.2FAToken.SMSSent" = "SMS Sent!";
"Login.out" = "Signed Out";

"Question.Mandatory" = "You must answer this question to continue.";
"Dropdown.InvalidSelection" = "You must select an option from the list.";

"Home" = "Home";
"Services" = "Services";
"Cancel" = "Cancel";
"Loading" = "Loading...";
"Dashboard" = "Dashboard";

"Sound.Options.None"= "None";
"Sound.Options.Speaker"= "Speaker";
"Sound.Options.Bluetooth"= "Bluetooth";
"Sound.Options.Cancel"= "Cancel";


"VideoCall.Dialog.Timeout" = "Please hold for the next available audio interpreter.";
"VideoCall.Dialog.Timeout.ASL" = "Thank you for holding for a Video Interpreter. We are connecting you to Customer Service.";
"VideoCall.Dialog.Timeout.TEST" = "Our video agents are all tied up. Would you like to schedule a test call?";
"VideoCall.Dialog.Timeout.BUSY" = "Our video interpreters are all tied up at the moment. Please return to the home screen and try again in a couple of minutes";
"VideoCall.Dialog.Timeout.CANCEL" = "Cancel";
"VideoCall.Dialog.Timeout.RETRY" = "Retry Video Call";
"VideoCall.Dialog.Timeout.option.AI" = "Roll Over to Audio Now";
"VideoCall.Dialog.Timeout.option.ASL" = "Speak to Customer Service Now";
"VideoCall.Dialog.Timeout.option.TEST" = "Schedule a Test Call";
"VideoCall.Dialog.Timeout.option.HOME" = "Return to Home";
"VideoCall.Dialog.Timeout.option.CANCEL" = "Cancel";
"VideoCall.Dialog.Timeout.option.RETRY" = "Retry Video Call";

"EpicCall.Dialog.Code.INVALID" = "Invalid access code";
"EpicCall.Dialog.Code.ERROR" = "Please enter the code displayed in Epic in the \"Join from GLOBO HQ\" window under the QR code.";

"Versions.UpdateRequired" = "Update Available";
"Versions.NotSupported" = "Current Version not Supported";
"Versions.UpdateRequired.Description" = "Please install latest available update from the AppStore.";
"Versions.NotSupported.Description" = "This version is no longer supported, please update your application.";
"Versions.Options.Update" =  "Update Now";
"Versions.Options.Later" = "Update Later";

"Feedback.Issues.Title" = "%@ Issues";
"Feedback.Categories.Title" = "We are sorry to hear about that. What was the biggest issue?";
"Feedback.Thanks.Label.2" = "Thank you, we really appreciate your feedback!";

"TrackingAuthorization.Dialog.Action.GoToSettings" = "Open Settings";
"TrackingAuthorization.Dialog.Action.CloseApp" = "Close App";
"TrackingAuthorization.Dialog.Title" = "Tracking Required";
"TrackingAuthorization.Required" = "\nIn order to use our app you must agree to the information tracking dialog. You can enable Tracking on Settings -> GLOBO -> Allow Tracking";
"ScheduledCallWaiting.Time" = "Your call starts at %@";
"ScheduledCallStart.Failed" = "Access code is not valid";
"ScheduledCallStart.Empty" = "Access code can not be empty";
"ScheduledCallPassword.Failed" = "Password is not valid";
"ScheduledCallPassword.Empty" = "Password can not be empty";
"ScheduledCallParticipantCode.Failed" = "Participant Code is not valid";
"ScheduledCallParticipantCode.Empty" = "Participant Code can not be empty";
"AIInterpreter.UnSupported" = "Thank you for your interest in GLOBO's Artificial Intelligence interpreter. Your organization has not yet been configured for this service. Stay tuned for more!";
